[
  {
    "id": "what-is-blockchain",
    "title": "What is a blockchain?",
    "summary": "Cryptocurrencies like Bitcoin and Ethereum are powered by a technology called the blockchain.",
    "image": "edu_blockchain",
    "imageURL": "https://images.ctfassets.net/q5ulk4bp65r7/70c1NBb3A7nvNpx38gSvtd/725e6c5da4960a5a17657c02b80dd596/Learn_Illustration_Ultimate_Guide_Blockchain.png?w=768&fm=png",
    "content": "Cryptocurrencies like Bitcoin and Ethereum are powered by a technology called the blockchain. At its most basic, a blockchain is a list of transactions that anyone can view and verify. The Bitcoin blockchain, for example, contains a record of every time someone sent or received bitcoin. Cryptocurrencies and the blockchain technology that powers them make it possible to transfer value online without the need for a middleman like a bank or credit card company.\n\nImagine a global, open alternative to every financial service you use today, accessible with little more than a smartphone and internet connection.\n\nThe list of transactions contained in the blockchain is fundamental for most cryptocurrencies because it enables payments to be made between people who don’t know each other without having to go through a third-party verifier like a bank.\n\nBlockchain technology is also exciting because it has many uses beyond cryptocurrency. Blockchains are being used to explore medical research, improve the accuracy of healthcare records, streamline supply chains, and so much more.\n\nWhat are some advantages of blockchains?\nThey’re global: which means that cryptocurrencies can be sent across the planet\n\nThey’re open: Because every single transaction on cryptocurrency networks is published publicly in the form of the blockchain, anyone can scrutinize them. That leaves no room for manipulation of transactions, changing the money supply, or adjusting the rules mid-game. The software that constitutes the core of these currencies is free and open-source so anyone can review the code.\n\nKey questions\n\nWhat’s the main advantage blockchains have over the old financial system?\n\nThink about how much of your financial life takes place online, from shopping to investing – and how every single one of those transactions requires a bank or a credit card company or payment processor like Paypal in the middle of it. Blockchains allow for those transactions to happen without a middleman, and without the added costs and complexity that come with them.\n\nIs Bitcoin a blockchain?\n\nBitcoin is a form of digital money. And the underlying technology that makes it possible is a blockchain.\n\nHow many kinds of blockchains are there?\n\nThousands, from the ones that power Bitcoin, Litecoin, Tezos, and countless other digital currencies to an increasing number that have nothing to do with digital money\n\nDisadvantages of Blockchain Technology\nEnergy Consumption: Many blockchain networks, especially those using proof-of-work consensus like Bitcoin, consume a substantial amount of energy, which raises environmental concerns.\n\nScalability Issues: As more transactions are added to the blockchain, the size of the database grows significantly, leading to slower transaction times and higher fees.\n\nRegulatory Uncertainty: The legal and regulatory environment for blockchain and cryptocurrencies is still evolving, which can create uncertainty and risk for users and businesses.\n\nHow does a blockchain work?\nPicture a chain you might use for a ship’s anchor. But in this case, every link on the chain is a chunk of information that contains transaction data. At the top of the chain you see what happened today, and as you move down the chain you see older and older transactions. And if you follow it all the way down to the anchor sitting at the bottom of the harbor? You’ll have seen every single transaction in the history of that cryptocurrency. Which gives the blockchain powerful security advantages: it’s an open, transparent record of a cryptocurrency’s entire history. If anyone tries to manipulate a transaction it will cause the link to break, and the entire network will see what happened. That, in a nutshell, is blockchain explained.\n\nAnother way people often describe the blockchain is that it’s a ledger (sometimes you’ll hear the terms ‘distributed ledger’ or ‘immutable ledger’), that is similar to the balance sheet of a bank. Like a bank’s ledger, the blockchain tracks all the money flowing into, out of, and through the network.\n\nBut unlike a bank’s books, a crypto blockchain isn’t maintained by any individual or organization, including banks and governments. In fact it isn’t centralized at all. Instead, it is maintained by a large peer-to-peer network of computers running open-source software. The network is constantly checking and securing the accuracy of the blockchain.\n\nWhere does new cryptocurrency come from? Every so often – around every ten minutes in the case of Bitcoin – a new chunk of transaction information (or a new block) is added to the chain of existing information. In exchange for contributing their computing power to maintaining the blockchain, the network rewards participants with a small amount of digital currency.\n\nA crypto blockchain is distributed across the digital currency’s entire network. No company, country, or third party is in control of it; and anyone can participate.\n\nThe network is constantly checking and securing the accuracy of the blockchain.\n\nKey questions\n\nHow do you send and receive money over a blockchain?\n\nThe cryptocurrency network assigns each user a unique ‘address,’ which is made up of a private key and a public key. Anyone can send you money via your public key, which is akin to an email address. When you want to spend your money, you use your private key, which is basically your password, to digitally ‘sign’ transactions. A way to manage your cryptocurrency is via software called a wallet, which you can get via an exchange like Coinbase.\n\nWho invented the blockchain?\nA person or group using the name Satoshi Nakamoto published a whitepaper online explaining the principles behind a new kind of digital money called Bitcoin in late 2008. Every cryptocurrency since is an evolution of the ideas laid out in that paper.\n\nNakamoto’s goal was to create digital money that would make online transactions between two strangers anywhere in the world possible without requiring a third party like a credit card company or a payment processor like Paypal in the middle.\n\nThis required a system that would eliminate a thorny issue called the ‘double spending’ problem, where a person might use the same money more than once. The solution is a network that is constantly verifying the movement of Bitcoin. That network is the blockchain.\n\nEvery Bitcoin transaction is stored and verified by a global network of computers beyond the control of any person, company, or country.\n\nThe database that holds all of that information is called the blockchain. Bitcoins are ‘mined’ via that huge, decentralized (also known as peer-to-peer) network of computers, which are also constantly verifying and securing the accuracy of the blockchain. In exchange for contributing their computing power to the blockchain, miners are rewarded with small amounts of cryptocurrency.\n\nEvery single bitcoin transaction is reflected on the ledger, with new information periodically gathered together in a “block,” which is added to all the blocks that came before.\n\nThe miners’ collective computing power is used to ensure the accuracy of the ever-growing ledger. Bitcoin can’t exist separately from the blockchain; each new bitcoin is recorded on it, as is each subsequent transaction with all existing coins.\n\nIn exchange for contributing their computing power to the blockchain, miners are rewarded with small amounts of cryptocurrency.\n\nWhat's the future of blockchains?\nThe blockchain idea has turned out to be a platform that a huge range of applications can be built on top of. It’s still a new and rapidly developing technology, but many experts have described blockchain’s potential to change the way we live and work as being similar to the potential public internet protocols like HTML had in the early days of the World Wide Web.\n\nThe Bitcoin Cash and Litecoin blockchains work in a very similar way to the original Bitcoin blockchain. The Ethereum blockchain is a further evolution of the distributed ledger idea, because unlike the Bitcoin blockchain it’s not solely designed to manage a digital money. (That said Ethereum is a cryptocurrency and certainly can be used to send value to another person). Think of the Ethereum blockchain more like a powerful and highly flexible computing platform that allows coders to build all kinds of applications leveraging the blockchain.\n\nFor example, imagine a charity that wants to send money to a thousand people every day for a year. With Ethereum, that would only take a few lines of code. Or maybe you’re a video game developer that wants to create items like swords and armor that can be traded outside of the game itself? Ethereum is designed to do that, too."
  },
  {
    "id": "defi-tokens-and-altcoins",
    "title": "Guide to DeFi tokens and altcoins",
    "summary": "From Aave to Zcash, get the info you need to decide what to trade",
    "image": "edu_wallet",
    "imageURL": "https://images.ctfassets.net/q5ulk4bp65r7/3rv8jr1B1Z1dZ2EhHqo7dp/e74ddbf1cd4836b83d34fe5cec351d78/Alt-Coin.png?w=768&fm=png",
    "content": "Whether you're just starting your crypto journey or you've been trading Bitcoin for years, there’s a good chance you’ve tried to dig into the world beyond Bitcoin and Ethereum only to find yourself confused by all the different cryptocurrencies out there.\n\nAfter all, in the decade since Bitcoin began to catch on, thousands of alternatives have emerged — with an ever-growing selection available via Coinbase. In the last few years, tokens that help power decentralized finance (or DeFi) protocols have become increasingly popular — and so a number of the cryptocurrencies on this list come from that world.\n\nIf you’re ready to figure out the difference between XTZ and XLM, you've come to the right place. Here (presented in alphabetical order) is key information about some of the biggest and most important cryptocurrencies that aren't Bitcoin or Ethereum. Each of these \"altcoins\" (short for “alternative coins”) is tradable via Coinbase and other major exchanges, and they all have unique features, goals, and use cases.\n\nAave (AAVE)\nReleased: November 2017\n\nAave is a decentralized lending protocol (part of the broader group of protocols known as DeFi) that allows users to deposit crypto assets to earn APY rewards, and to borrow other crypto assets against that collateral. It makes it possible for users to borrow, lend, and earn interest on their crypto — making use of smart contracts instead of intermediaries like banks. \n\nAAVE is a “governance token” that gives holders a say in the future of the protocol. It can also be staked, thus earning rewards for holders. \n\nThe Aave protocol facilitates the creation of lending pools. If you want to lend some of your crypto, you can deposit it into a pool. Anyone who wants to borrow deposited assets can draw from Aave pools as long as they provide sufficient collateral. (Fun fact: “Aave” means ghost in Finnish.) \n\nHow it works:\n\nThere are two types of tokens issued by the protocol: the native AAVE token and aTokens. \n\nAAVE tokens, beyond giving holders a say in the protocol’s governance, offer advantages including discounts on fees or free use of some of the protocol’s services.\n\n aTokens are received by lenders depositing to the lending pools, and they entitle them to earn interest payments. (If you deposit, say, ETH, you’ll receive aETH in return. When you pull your ETH out of Aave, your aETH will automatically be converted back to ETH.)\n\nTo help users take advantage of arbitrage opportunities (where a crypto might be valued higher on one exchange than it is on another) and maximize profits in the DeFi ecosystems, Aave also provides flash loans. These loans require no collateral and are settled instantly. The condition is that the borrowed amount needs to be paid back within the same transaction, along with a 0.09% fee, or the whole process will be cancelled and no funds are borrowed.\n\nYou can connect your crypto wallet to Aave at app.aave.com\n\nKeep in mind: Standard loans on Aave require collateral (such as ETH) provided by the borrower. Because crypto can be volatile, it’s important to choose the collateral carefully if you use Aave to borrow crypto.  If your collateral’s value drops below a certain threshold it can be liquidated and you might be subject to added fees. For this reason, stablecoins are a popular collateral option.\n\nAlgorand (ALGO)\nReleased: June, 2019\n\nAlgorand seeks to build on similar projects like Ethereum by improving scalability, security, and reducing the amount of time it takes for transactions on the network to be considered “final.” Developers can use Algorand to create decentralized applications that take advantage of fast, low-cost transactions while scaling to a large number of users.\n\nHow it works: Algorand nodes reach consensus via PPoS (Pure Proof of Stake) — a staking system (instead of Proof of Work). Participants stake ALGO for a chance to propose a new block and earn rewards.\n\nBitcoin Cash (BCH)\nReleased: August, 2017\n\nBitcoin Cash continues the peer‑to‑peer cash idea via a high‑volume, low‑fee network. It increases Bitcoin’s 1MB block size to 32MB, enabling faster confirmation and lower fees.\n\nCardano (ADA)\nReleased: September 2017\n\nCardano is a next‑gen smart‑contract platform using an energy‑efficient proof‑of‑stake mechanism called Ouroboros. It separates the blockchain into CSL (settlement) and CCL (computing) layers to scale.\n\nChainlink (LINK)\nReleased: November, 2017\n\nChainlink is a decentralized oracle network powering DeFi with reliable external data. LINK is used to pay for oracle services and incentivize honest nodes.\n\nCompound (COMP)\nReleased: September 2018\n\nCompound is a lending protocol: deposit assets to earn interest, borrow against collateral, and receive cTokens representing your deposits. COMP token holders vote on protocol changes.\n\nCosmos (ATOM)\nReleased: March 2019\n\nCosmos aims to be the “internet of blockchains,” interconnecting custom chains via IBC and securing the hub with ATOM staking.\n\nDash (DASH)\nReleased: January, 2014\n\nDash uses Masternodes to instantly verify transactions; operators stake 1,000 DASH and earn rewards.\n\nDogecoin (DOGE)\nReleased: December 2013\n\nDogecoin began as a memecoin but grew into a large‑cap asset. Unlike Bitcoin’s scarcity, DOGE is inflationary: ~130B supply and +10,000 minted per minute."
  },
  {
    "id": "what-is-defi",
    "title": "2020 tax guide: crypto and Bitcoin in the U.S.",
    "summary": "Did you buy, sell, use, or trade crypto? If so, you may owe taxes if you’re a US taxpayer.",
    "image": "edu_defi",
    "imageURL": "https://images.ctfassets.net/q5ulk4bp65r7/1uXiQevA2GlXztX6KMFXex/4b98522e07247f2b5a6777b01337b858/Learn_Illustration_Ultimate_Guide_Taxes.png?w=768&fm=png",
    "content": "1.1 Do I have to pay crypto taxes?\n1 Million dollar (crossed out) crypto question \nAt Coinbase, we see crypto as the foundation for tomorrow’s open financial system — but it’s also a part of today’s traditional one. To answer the many questions on crypto and taxes, the IRS has issued crypto tax guidance.\n\nIn previous tax seasons, we received a lot of questions from crypto newbies and experienced customers alike. We get it — paying taxes on bitcoin and other crypto can be confusing. While we can’t give tax advice, we want to make crypto easier to buy, sell, and use. This guide is our way of helping you better understand your crypto tax obligations for the 2020 tax season and detail Coinbase resources available to you that makes the process easier.\n\nThere’s a lot of conflicting content out there, but make no mistake: you are required to report gains and losses on each transaction or when you earn cryptocurrency, even if the gain or loss is not material. The IRS holds you responsible for reporting all income and transactions whether you receive a tax form from a crypto exchange or not. Exchanges like Coinbase make transaction history available for this purpose.\n\nOne quick note if you’re a non-US investor: taxes on crypto are treated differently country-to-country. This guide only covers the US requirements. Unless you happen to have some US tax obligations (this is rare) be sure to consult your local country tax advisor to confirm your tax reporting obligations at your home jurisdiction.\n\nIn a nutshell... All crypto sells, conversions, payments, donations, and earned income are reportable by US taxpayers \nBuying and selling crypto is taxable because the IRS identifies crypto as property, not currency. As a result, tax rules that apply to property (but not real estate tax rules) transactions, like selling collectible coins or vintage cars that can appreciate in value, also apply to bitcoin, ethereum, and other cryptocurrencies.\n\nThe IRS isn’t kidding around. Failure to report income, including income from the sale of crypto, could result in IRS levying penalties. Starting with 2019 tax returns, the IRS requires you to answer “yes” or “no” to a question about whether you had any crypto transactions during the year. Please consult with a tax-planning professional regarding your individual reporting obligations.\n\nWith all that in mind, here’s our list of steps you can take to help you understand if you may need to pay crypto taxes, how to determine the amount, and what forms you may need. Let’s dive in.\n\n2: Steps to take \n2.1 Determine if you owe crypto taxes\nEven if you’re in the “Just HODL it” camp, it’s worth evaluating your crypto transactions to determine if you may owe taxes.\n\nWhat's taxable\nIn short, a lot. Here are some examples of taxable crypto events:\n\nSelling crypto for cash: in other words, realizing the gain on your crypto property (don't forget lossed could help with your tax bill) and Paying for goods or services (for example using bitcoin to buy a pizza) \nBuying one crypto with another crypto (ie 'converting' one crypto into another. Using bitcoin to buy ethereum is considered a disposition of the bitcoin, for example\n\n Receiving mined crypto (including bitcoin, ethereum classic and more) \nBeing paid in crypto or by airdrop. Example: when you're paid in crypto by an employer your crypto is classified as compensation and will be taxes according to your income tax bracket. And Receiving crypto rewards, including staking rewards and interest earned \nTransactions must be reported at their fair market value as measured in US dollars. So if you bought a pizza with bitcoin, you would have a disposition of the bitcoin equal to the cost of the pizza (the fair market value) in dollars.\n\nAirdrops and tax implications\nIf you received free crypto through an airdrop, how the crypto is used will have an impact on how it is taxed. Airdrops are like free money received in a giveaway or in a lottery winning so they should generally be taxable as ordinary income valued at the fair market value on the date of receipt.\n\nIf it’s sitting in your wallet, but Coinbase or any other exchange has not yet started supporting the protocol such that you can’t do anything with it, it’s not taxable yet. Crypto received in a fork becomes taxable when you have the ability to transfer, sell, exchange or otherwise do something with it. See the IRS FAQs (Q21 - Q24) and Rev Rul 2019-24 for IRS guidance on forks and airdrops\n\nWhat's not taxable\nSome non-taxable events include:\n\nWhat's nontaxable: donating crypto to qualified tax-exempt charity or non-profit (givecrypto.org for example). Buying crypto with cash and holding it (HODLers, anyone? There's no gain or loss recognized if it is just held. Transferring crypto between wallets: Make sure to check the transaction records of your exchanges to confirm they're not recorded as dispositions. Transferring crypto between Coinbase accounts, or from an external wallet to a coinbase account.  \nSo, you have crypto transactions to report?\nFirst, you’ll need a single view of all your crypto-related transactions, each of which should be reported on your tax return.\n\nCharitable contributions and gifts of crypto and tax implications\nRecipient of a gift: If you are lucky enough to receive crypto as a gift you are not likely to have a taxable event until you sell the crypto. When you do, your cost basis will be the same cost as the person who gifted it to you.\n\nPerson who gives the gift: You can gift crypto up to $15,000 per recipient per year without paying taxes. If your gift exceeds $15,000 per recipient, you are required to file a gift tax return.\n\nCharitable donations:  If you give crypto directly to a 501 (3) charitable organization, you can claim a charitable deduction equal to the fair market value of the donated cryptocurrency.\n\nCoinbase customers\nCoinbase customers can generate reports with all buys, sells, sends, and receives of all crypto associated with their Coinbase and Coinbase Pro accounts. Please remember: these reports only detail transactions associated with your Coinbase account, and will not be correct if you moved crypto from other wallets or exchanges as Coinbase doesn’t have information about your holdings on other exchanges and platforms. If you use other exchanges, you’ll need to download separate reports from them and reconcile.\n\nDownload your Coinbase transaction history report\n\nDownload your Pro transaction history report\n\nFor all transactions, you need the cost basis of each transaction — the amount in dollars that you spent originally to buy it — and the amount in dollars it was worth when you sold it. This will be used to calculate your gains and losses.\n\n2.2 Calculate gains and losses\nNow that you have a comprehensive view of your activity, you’ll need to figure out whether you incurred gains or losses on each transaction. This means you’ll need to review each transaction and determine the cost basis to see if it’s a loss or a gain.\n\nFYI:\nLosses may be used to offset capital gains in a given tax year, plus $3,000 — this means that any losses incurred on bitcoin and other crypto may be deductible, unlike losses on your car.\n\nCoinbase customers: Use our Transaction History Report\nCustomers can utilize their Transaction History Report to determine a preliminary gain/loss amount for their Coinbase activity. This report is intended to assist you in compiling information, but it will not have information about crypto-related transactions outside of Coinbase. It's important to review and verify the information for accuracy depending on how you transacted on Coinbase. This tool shouldn’t be used as an official tax documentation.\nApplying a method to get a certain tax treatment for crypto transactions (e.g. SpecID, LIFO)\nIf you bought extensive amounts of cryptocurrency at different times and sold only a portion of it, you may be wondering if the ones you sold should use the costs of the first crypto purchased, the last ones purchased, or if you should use the Specific Identification method. Customers have the choice of lot selection methods and should consult with their tax advisors on which method best suits their individual tax situation. The IRS considers cryptocurrency to be property, like stock, and says general principles that apply to capital assets, should apply to crypto transactions.\n\nSee IRS FAQ Q36-Q38 for their guidance on methods of reporting\n\n2.3 consult a tax professional\nWe’re go-getters and DIYers, and a lot of our customers are the same, but paying taxes on bitcoin and other crypto is complex. So when in doubt, consult a qualified tax professional. In plain English, Coinbase doesn’t provide tax advice, even though we want every member of the crypto community to avoid the confusion we’ve seen in the past few years. This educational guide was prepared for general informational purposes only, and we hope it helps, but we just can’t replace the attention a tax professional will give your unique situation.\n\nImplications of hard forks on tax obligations\nIf you received free crypto as a result of a fork, your free crypto will be treated like free money received in a giveaway so it would be taxable as ordinary income valued at the fair market value on the day it is received. The fair market value is the amount someone would pay for the cryptocurrency on the date of receipt.\n\nIf it’s sitting in your wallet, but Coinbase or any other exchange has not yet started supporting the protocol and so you can’t do anything with it, it’s not taxable yet. Crypto received in a fork becomes taxable when you have the ability to transfer, sell, exchange or otherwise do something with it. See IRS FAQ Q21 - Q24 and Rev Rul 2019-24 for IRS guidance on forks and airdrops.\n\n2.4 Prepare your forms\nHere are some forms you may want to get familiar with. Some we provide, and some you put together yourself.\n\nForms you may need\nForm 8949 Have transactions that qualify as a capital gain or loss? Those go here and can be filled out using your transaction reports from various exchanges.\n\nForm 1040 (Schedule D, Capital Gains and Losses) Commonly referred to as just Schedule D, this is the summary of your capital gains and losses.\n\nForm 1099-MISC (Miscellaneous Income) This Form is used to report rewards/ fees income from staking, Earn and other such programs if a customer has earned $600 or more in a tax year.\n\nAmerican taxpayer living abroad?\nIf you live outside the US, you’ll want to check to see if you’ve received all the forms you need to file your tax return. Just in case, make sure you have detailed transaction history reports that reflect all your purchases and sales across all exchanges you used. If necessary, you may have to contact your exchanges directly.\n\n2.5 File your taxes\nYou’ve got your transactions, you know your gains and losses, you’ve consulted a tax-planning professional, and you have your forms ready. Pat yourself on the back: you’re probably ready to file your taxes (though it doesn’t hurt to check with the experts one last time).\n\nCongratulations, and we hope this guide helped you out!\n\n4.0 Resources and extra info\n4.1 Official IRS Guidance\nBe in the know about what the IRS says about the taxation of bitcoin and crypto. It’s worth reviewing the official IRS guidance from 2019, their cryptocurrency FAQ and Publication 544.\n\n4.2 Stablecoin\nIf you hold a stablecoin such as USD Coin valued at $1 (and you bought it at $1), you have no gains or losses when you sell out of that stablecoin.\n\n4.3 Important terms\nCapital assets — property you own (stocks, bonds, a home, crypto).\nCost basis — the dollar cost you paid for crypto when purchased, adjusted for related costs.\nFIFO / LIFO / SpecID — common methods for assigning cost basis to disposals.\nFair market value — dollar value of crypto at the time of a transaction.\nGains — profits on property (unrealized vs realized).\nLike‑kind exchanges — since 2018 apply only to real estate, not crypto‑to‑crypto.\nLong‑ vs short‑term gains — holding >1 year vs <1 year (rates often differ).\nLosses — can offset capital gains (plus $3,000).\nOrdinary assets — inventory/stock‑in‑trade; consult a professional if unsure.\nProceeds — amount received when selling property (or USD value of crypto received in a conversion).\n\n4.4 Relevant tax forms\nForm 8949 — report sales/dispositions of capital assets.\nForm 1040 Schedule D — summarize capital gains and losses.\nForm 1099‑MISC — report rewards/fees income (staking, Earn, etc.) if >= $600 in a tax year."
  },
  {
    "id": "what-is-a-token",
    "title": "What is a token?",
    "summary": "Technically, “token” is just another word for “cryptocurrency” or “cryptoasset.” But increasingly it has taken on a couple of more specific meanings depending on context..",
    "image": "edu_token",
    "imageURL": "https://images.ctfassets.net/q5ulk4bp65r7/5Dhk0rBQjluyfM7qXWuXC4/d3be5bb4b28724813348f9d8f2de8d56/Learn_Illustration_What_is_a_Token.jpg?w=768&fm=png",
    "content": "Technically, “token” is just another word for “cryptocurrency” or “cryptoasset.” But increasingly it has taken on a couple of more specific meanings depending on context. The first is to describe all cryptocurrencies besides Bitcoin and Ethereum (even though they are technically also tokens). The second is to describe certain digital assets that run on top of another cryptocurrencies’ blockchain, as many decentralized finance (or DeFi) tokens do. Tokens have a huge range of potential functions, from helping make decentralized exchanges possible to selling rare items in video games. But they can all be traded or held like any other cryptocurrency.\n\n“Token” is a word that you hear a lot in cryptocurrency. In fact, you might hear Bitcoin described as a “crypto token” or something similar, because — technically — all cryptoassets can also be described as tokens. But the word has increasingly taken on two specific meanings that are common enough that there’s a good chance you’ll encounter them. \n\nA “token” often refers to any cryptocurrency besides Bitcoin and Ethereum (even though they are also technically tokens). Because Bitcoin and Ethereum are by far the biggest two cryptocurrencies, it’s useful to have a word to describe the universe of other coins. (Another word you might hear with virtually the same meaning is “altcoin.”)\n\nThe other increasingly common meaning for “token” has an even more specific connotation, which is to describe cryptoassets that run on top of another cryptocurrency’s blockchain. You’ll encounter this usage if you become interested in decentralized finance (or DeFi). While a cryptocurrency like Bitcoin has its own dedicated blockchain, DeFi tokens like Chainlink and Aave run on top of, or leverage, an existing blockchain, most commonly Ethereum’s. \n\nTokens in this second category help decentralized applications to do everything from automate interest rates to sell virtual real estate. But they can also be held or traded like any other cryptocurrency.\n\nWhy are tokens important?\nGiven that you’ll come across the word a lot while researching cryptocurrencies, it’s useful to understand some common connotations. But besides the big-picture definitions in the section above, there are also some categories of cryptoassets that actually have “token” in their name. Here are a few examples of those:\n\nDeFi tokens A new world of cryptocurrency-based protocols that aim to reproduce traditional financial-system functions (lending and saving, insurance, trading) has emerged in recent years. These protocols issue tokens that perform a wide variety of functions but can also be traded or held like any other cryptocurrency.\n\nGovernance tokens These are specialized DeFi tokens that give holders a say in the future of a protocol or app, which (being decentralized) don’t have boards of directors or any other central authority. The popular savings protocol Compound, for example, issues all users a token called COMP. This token gives holders a vote in how Compound is upgraded. The more COMP tokens you have, the more votes you get.\n\nNon-Fungible Tokens (NFTs)  NFTs represent ownership rights to a unique digital or real-world asset. They can be used to make it more difficult for digital creations to be copied and shared. They’ve also been used to issue a limited number of digital artworks or sell unique virtual assets like rare items in a video game. \n\nSecurity tokens Security tokens are a new class of assets that aim to be the crypto equivalent of traditional securities like stocks and bonds. Their main use case is to sell shares in a company (very much like the shares or fractional shares sold via conventional markets) or other enterprises (for instance, real estate) without the need for a broker. Major companies and startups have been reported to be investigating security tokens as a potential alternative to other methods of fundraising."
  },
  {
    "id": "what-is-mining",
    "title": "22% of Vietnamese Citizens Use Cryptocurrency Amidst Regulatory Pressure",
    "summary": "The Socialist Republic of Vietnam is one of the biggest Bitcoin users in the world and the cryptocurrency industry is growing at a high speed in this Southeast Asian country. .",
    "image": "edu_mining",
    "imageURL": "https://coinidol.com/upload/medialibrary/c8b/c8bfa740252d92fc353ae56671b49ea9.jpg",
    "content": "The Socialist Republic of Vietnam is one of the biggest Bitcoin users in the world and the cryptocurrency industry is growing at a high speed in this Southeast Asian country. Around 22% of the citizens own or transact with cryptos.\n\nWhen Bitcoin was launched in 2009, Vietnamese didn’t have full knowledge of how this technology works. The citizens first paid less attention to it but they had to study and see its potential. The first Bitcoin transaction in the country was registered in late 2013 via a pioneering digital asset startup Bitcoin Vietnam in collaboration with an online cryptocurrency broker in Israel Bits of Gold.\n\n\nChanging attitudes\n\nThe crypto users in Vietnam started to appreciate the benefits of making transactions using digital currencies such as lower transaction fees, no chargebacks, unprecedented trust between crypto companies and their customers, no inflation, quick receipt of money than via legacy financial institutions, and many others. All these benefits positively changed Vietnamese’s attitude towards cryptocurrency. In Vietnam, digital currency is available in popular forms such as debit cards, credit cards, or mobile wallets.\n\n\n\n\nThe use of cryptocurrencies in the country has been growing significantly due to several factors including the cheap cost of electricity that favor the crypto mining business, existing friendly financial regulations, and others. According to the report by VietnamNews, there are over a million crypto-asset users in Vietnam with huge amounts of USD in transactions daily. Some of the crypto exchanges operating in the country include eToro, Coinmama, Ginero, Bitcoin Vietnam, VBTC that recently integrated the Lightning Network, and many others.\n\n\nAmong the 74 countries that were surveyed, Vietnam has the second-highest rate after Nigeria in terms of digital currency use, and this rate has increased majorly due to the growth of remittance payments in the country, according to the report by Statista. Even though the State Bank of Vietnam (SBV) has gone ahead to warn that owning, trading and using digital currency is risky and not protected by laws, the research by Statista revealed that more than 22% of the population in Vietnam use or own cryptocurrency.\n\n\nLegal uncertainty\n\nThe ease of doing cryptocurrency business is still at stake in Vietnam caused by many factors including the language barrier issue. The local people who don’t speak English find it hard to use crypto wallets or other cryptocurrency services to transact.\n\n\nBesides, issuing, supplying, or using cryptocurrency as means of payment is an act prohibited in the country. Bitcoin and other forms of cryptocurrencies aren’t considered legal means of payment in Vietnam since cryptocurrency is not defined as a currency or as a means of payment. However, no single person has been arrested for using Bitcoin or any form of digital currency, meaning that the ban is mostly formal.\n\n\n\n\nNevertheless, the financial watchdogs are on the alert. Back in 2017, FTP University had accepted its foreign students to pay tuition using Bitcoin but the Vietnamese state bank stopped this move. The institution went ahead to warn that whoever was caught violating the law (paying using crypto such as BTC) would pay a fine of VND 150 million (about USD 6,500) to VND 200 million (approx. USD 8667).\n\n\nProspects for the future of crypto\n\nHowever, the future of digital currencies seems to be promising. The country’s central bank is doing everything possible that could help the country promote intra-regional integration, economic and financial connectivity.\n\n\nThe two initiatives dubbed \"Sustainable finance in ASEAN\" and \"Promoting regional payment connectivity\" have so far been introduced. Within both initiatives, CBDC has been proposed as fuel for digital transformation and technological innovations in the country’s financial and banking industry.\n\n\nBut to ensure the growth of the industry, the government needs to properly regulate the digital currency sector instead of deeming it illegal. This would give a chance for fintech innovations including cryptocurrency to prosper. "
  }
]


