[
  {"id":"a-accepting-risk","letter":"A","term":"Accepting Risk (Acceptance)","definition":"Risk management strategy of accepting certain risks instead of spending resources to mitigate them.","detail":"Accepting risk means acknowledging potential loss exposure and choosing to tolerate it. Companies may accept risks when mitigation costs exceed expected loss or when risks are minimal."},
  {"id":"a-absolute-return","letter":"A","term":"Absolute Return","definition":"Total investment return (positive or negative) over a period of time.","detail":"Absolute return looks at the actual gain or loss experienced by an asset, independent of any benchmark."},
  {"id":"b-backtesting","letter":"B","term":"Backtesting","definition":"Testing a strategy using historical data to evaluate performance.","detail":"Backtesting simulates how a strategy would have performed using past price and volume data. Good backtests require realistic assumptions about slippage, fees and execution."},
  {"id":"b-bail-out","letter":"B","term":"Bail-Out","definition":"Capital injection or resources given to prevent a financial downfall.","detail":"A bailout can be provided by governments or private entities to rescue companies or protocols from insolvency or collapse."},
  {"id":"c-cold-wallet","letter":"C","term":"Cold Wallet","definition":"Offline crypto wallet that isn’t connected to the internet.","detail":"Cold storage methods (hardware wallets, paper wallets) reduce exposure to online hacks by keeping private keys offline."},
  {"id":"c-consensus","letter":"C","term":"Consensus Mechanism","definition":"Method blockchains use to agree on the state of the ledger.","detail":"Popular mechanisms include Proof of Work (PoW) and Proof of Stake (PoS). They coordinate validators/miners to add blocks securely."},
  {"id":"d-dapp","letter":"D","term":"dApp (Decentralized Application)","definition":"Application that runs on a blockchain or P2P network.","detail":"dApps use smart contracts for backend logic and typically feature open-source code, token incentives and censorship resistance."},
  {"id":"d-defi","letter":"D","term":"DeFi","definition":"Decentralized finance — on-chain protocols for lending, trading, and more.","detail":"DeFi removes centralized intermediaries using smart contracts to enable lending, borrowing, swaps, derivatives and yield strategies."},
  {"id":"e-erc20","letter":"E","term":"ERC‑20","definition":"Ethereum token standard for fungible tokens.","detail":"ERC‑20 defines common rules for tokens (transfer, balance, approval) enabling wallets and dApps to interoperate."},
  {"id":"e-exchange","letter":"E","term":"Exchange","definition":"Marketplace to buy, sell or trade cryptocurrencies.","detail":"Exchanges can be centralized (CEX) or decentralized (DEX). CEXs custody user funds; DEXs use smart contracts and liquidity pools."},
  {"id":"f-fiat","letter":"F","term":"Fiat Currency","definition":"Government‑issued money not backed by a commodity.","detail":"Examples: USD, EUR. Fiat is legal tender and is typically managed by central banks with monetary policy tools."},
  {"id":"f-fomo","letter":"F","term":"FOMO","definition":"Fear of missing out — emotional bias leading to impulsive buying.","detail":"FOMO can cause traders to chase rallies without proper risk management."},
  {"id":"g-gas","letter":"G","term":"Gas","definition":"Fee paid to execute operations on a blockchain (e.g., Ethereum).","detail":"Gas covers computation and storage. Price fluctuates with network demand; users set gas price and limit."},
  {"id":"g-governance-token","letter":"G","term":"Governance Token","definition":"Token granting voting rights in a protocol.","detail":"Holders can propose and vote on upgrades, treasury usage and parameter changes."},
  {"id":"h-halving","letter":"H","term":"Halving","definition":"Periodic reduction of block rewards (e.g., Bitcoin halves every ~4 years).","detail":"Halvings reduce new supply issuance, historically impacting mining economics and market dynamics."},
  {"id":"h-hodl","letter":"H","term":"HODL","definition":"Long‑term holding of crypto regardless of volatility.","detail":"Originated from a misspelled ‘hold’; implies conviction in long‑term value."},
  {"id":"i-ico","letter":"I","term":"ICO","definition":"Initial Coin Offering — token sale to raise funds.","detail":"Investors receive tokens; regulatory treatment varies by jurisdiction. Alternatives include IEOs and IDOs."},
  {"id":"i-impermanent-loss","letter":"I","term":"Impermanent Loss","definition":"Loss faced by liquidity providers compared to holding assets.","detail":"Occurs when relative prices change; fees and incentives can offset IL."},
  {"id":"j-json-rpc","letter":"J","term":"JSON‑RPC","definition":"Lightweight data protocol used by blockchain nodes.","detail":"Wallets and dApps use JSON‑RPC to call node methods (e.g., eth_call, eth_sendRawTransaction)."},
  {"id":"j-jit-liquidity","letter":"J","term":"JIT Liquidity","definition":"Providing liquidity just‑in‑time to capture fees on DEXs.","detail":"Common on concentrated AMMs like Uniswap v3; considered a form of MEV strategy."},
  {"id":"k-kyc","letter":"K","term":"KYC","definition":"Know Your Customer — identity verification requirements.","detail":"KYC/AML policies aim to prevent illicit activity on exchanges and fintech platforms."},
  {"id":"k-keypair","letter":"K","term":"Key Pair","definition":"Private and public keys used to sign and verify transactions.","detail":"Private keys must be kept secret; public keys/addresses are shared to receive funds."},
  {"id":"l-layer2","letter":"L","term":"Layer 2","definition":"Scaling solutions that process transactions off‑chain then settle on L1.","detail":"Examples: rollups (Optimistic, ZK), state channels. Reduce fees and increase throughput."},
  {"id":"l-liquidity-pool","letter":"L","term":"Liquidity Pool","definition":"On‑chain pool of tokens used by AMMs for swaps.","detail":"LPs deposit token pairs to earn trading fees and incentives; pool price determined algorithmically."},
  {"id":"m-market-cap","letter":"M","term":"Market Cap","definition":"Total value = price × circulating supply.","detail":"Used to compare asset size; not the same as fully diluted valuation (FDV)."},
  {"id":"m-mev","letter":"M","term":"MEV","definition":"Maximal Extractable Value by block producers/validators.","detail":"Profit from transaction ordering, inclusion or censorship; mitigated via auctions and protocol design."},
  {"id":"n-nft","letter":"N","term":"NFT","definition":"Non‑fungible token representing unique digital or real‑world items.","detail":"NFTs use standards like ERC‑721/1155 and enable provenance and ownership on‑chain."},
  {"id":"n-node","letter":"N","term":"Node","definition":"Computer that participates in a blockchain network.","detail":"Nodes verify and relay transactions; some produce blocks, others maintain copies of the ledger."},
  {"id":"o-oracle","letter":"O","term":"Oracle","definition":"Service that feeds external data to smart contracts.","detail":"Oracles aggregate off‑chain data (prices, weather) and deliver to on‑chain apps securely."},
  {"id":"o-omg","letter":"O","term":"OMG","definition":"Slang: ‘Oh My God’; also former ticker for OMG Network.","detail":"In crypto slang, used to express surprise; historically a project focused on scaling payments."},
  {"id":"p-private-key","letter":"P","term":"Private Key","definition":"Secret key used to sign transactions and control funds.","detail":"Loss or exposure of the private key results in loss of assets; use hardware wallets for safety."},
  {"id":"p-proof-of-stake","letter":"P","term":"Proof of Stake (PoS)","definition":"Consensus where validators stake tokens to secure the network.","detail":"Validators are selected to propose/attest to blocks and earn rewards; misbehavior can be penalized (slashing)."},
  {"id":"q-qrcode","letter":"Q","term":"QR Code","definition":"Two‑dimensional barcode used to encode addresses and payment info.","detail":"Wallets scan QR codes to avoid manual entry and reduce errors."},
  {"id":"q-quorum","letter":"Q","term":"Quorum","definition":"Minimum participation needed to pass governance proposals.","detail":"DAO proposals often require quorum plus a majority or supermajority to pass."},
  {"id":"r-rug-pull","letter":"R","term":"Rug Pull","definition":"Scam where developers drain liquidity or abandon a project.","detail":"Common red flags: unaudited contracts, anonymous teams, unrealistic yields."},
  {"id":"r-rollup","letter":"R","term":"Rollup","definition":"Layer‑2 that batches transactions and posts proofs/data to L1.","detail":"Optimistic and ZK rollups differ in proof model and finality times."},
  {"id":"s-smart-contract","letter":"S","term":"Smart Contract","definition":"Self‑executing code on a blockchain.","detail":"Smart contracts enforce rules automatically when predefined conditions are met."},
  {"id":"s-stablecoin","letter":"S","term":"Stablecoin","definition":"Token pegged to a stable asset (e.g., USD).","detail":"Types include fiat‑backed, crypto‑collateralized and algorithmic designs."},
  {"id":"t-tvl","letter":"T","term":"TVL","definition":"Total Value Locked in a DeFi protocol.","detail":"Represents the dollar value of assets deposited across lending, staking and AMMs."},
  {"id":"t-tokenomics","letter":"T","term":"Tokenomics","definition":"Economic design of a token: supply, distribution, incentives.","detail":"Good tokenomics align users, developers and investors to grow the ecosystem sustainably."},
  {"id":"u-ux","letter":"U","term":"UX","definition":"User experience — overall quality of interaction with a product.","detail":"In crypto, good UX hides key‑management complexity and simplifies transactions."},
  {"id":"u-unbonding","letter":"U","term":"Unbonding","definition":"Period after unstaking when funds are locked before becoming liquid.","detail":"Common in PoS chains; discourages quick in‑and‑out staking and secures the network."},
  {"id":"v-validator","letter":"V","term":"Validator","definition":"Participant in PoS networks that validates blocks.","detail":"Validators stake tokens, run nodes, earn rewards and risk slashing for misbehavior."},
  {"id":"v-volatility","letter":"V","term":"Volatility","definition":"Measure of price variability over time.","detail":"Higher volatility implies larger price swings and risk; often measured by standard deviation."},
  {"id":"w-wallet","letter":"W","term":"Wallet","definition":"Software or hardware that stores keys and manages crypto.","detail":"Wallets can be custodial or non‑custodial; seed phrases back up keys."},
  {"id":"w-whale","letter":"W","term":"Whale","definition":"Entity holding very large amounts of crypto.","detail":"Whale activity can impact liquidity and price; on‑chain data may track whale wallets."},
  {"id":"x-xpub","letter":"X","term":"xPub Key","definition":"Extended public key used to derive many addresses.","detail":"xPub allows generating receive addresses without exposing private keys."},
  {"id":"x-xrpl","letter":"X","term":"XRPL","definition":"XRP Ledger — decentralized blockchain powering XRP.","detail":"XRPL features fast settlement and a unique consensus protocol (RPCA)."},
  {"id":"y-yield-farming","letter":"Y","term":"Yield Farming","definition":"Strategy to earn returns by supplying liquidity and staking.","detail":"Users move assets across protocols to optimize APY, considering fees and risks."},
  {"id":"y-ytd","letter":"Y","term":"YTD","definition":"Year‑to‑date — performance since the beginning of the year.","detail":"Used to compare returns for the current calendar year."},
  {"id":"z-zero-knowledge","letter":"Z","term":"Zero‑Knowledge Proof","definition":"Method to prove a statement without revealing underlying data.","detail":"ZKPs power privacy‑preserving systems and efficient rollups (ZK‑rollups)."},
  {"id":"z-zombie-chain","letter":"Z","term":"Zombie Chain","definition":"Network with little activity or development.","detail":"Often refers to chains that lost community traction or funding."}
]


